In [74]:
import numpy as np
import pandas as pd

In [75]:
#COUNT -------------------------------------------###
zoo = pd.read_csv('datasets/zoo.csv', delimiter = ',')
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [6]:
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

In [10]:
zoo.animal.count()
#zoo[['animal']].count()

animal    22
dtype: int64

In [13]:
#SUM -------------------------------------------###
zoo.water_need.sum()

7650

In [14]:
zoo.sum()
#concat each column string value
#sum each columns values

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

In [16]:
zoo.uniq_id.sum()

22253

In [17]:
#MIN & MAX -------------------------------------------###
zoo.water_need.max()

600

In [19]:
zoo.water_need.min()

80

In [20]:
#MEAN & MEDIAN -------------------------------------------###
zoo.water_need.mean()

347.72727272727275

In [21]:
zoo.water_need.median()

325.0

In [22]:
#GROUPING --------------------------------------------------------------------###
#mean grouped by animal species: ops, it's calculating all columns. It seems wrong :/. let's fix
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [24]:
#mean just for  WATER_NEED column
# mean().water_need return Series object
zoo.groupby('animal').mean().water_need

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

In [26]:
# mean().[['water_need']] returns a DataFrame object
zoo.groupby('animal').mean()[['water_need']]

          water_need
animal
elephant  550.000000
kangaroo  416.666667
lion      477.500000
tiger     310.000000
zebra     184.285714

In [43]:
#store in a variable
article_read = pd.read_csv('datasets/article_read.csv',
                           delimiter=';',
                           names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])
article_read.sample(3)

              my_datetime event    country     user_id   source          topic
1721  2018-01-01 23:13:28  read  country_5  2458152982  AdWords  North America
973   2018-01-01 13:02:02  read  country_5  2458152234      SEO  North America
109   2018-01-01 01:37:44  read  country_7  2458151370   Reddit           Asia

In [51]:
#What’s the most frequent source in the article_read dataframe?
article_read.groupby('source').count()

         user_id
source
AdWords      500
Reddit       949
SEO          346

In [56]:
#Remove unNecesssary columns: JUST RESULT
article_read.groupby('source').count()[['user_id']]

         user_id
source
AdWords      500
Reddit       949
SEO          346

In [ ]:
#For the users of country_2, what was the most frequent topic and source combination? 
#Or in other words: which topic, from which source, brought the most views from country_2?

In [73]:
article_read[article_read.country == 'country_2'].groupby(['source', 'topic']).count()[['user_id']]

                       user_id
source  topic
AdWords Africa               3
        Asia                31
        Australia            6
        Europe              46
        North America       11
        South America       14
Reddit  Africa              24
        Asia               139
        Australia           18
        Europe              29
        North America       27
        South America       26
SEO     Africa               7
        Asia                 9
        Australia           10
        Europe               4
        North America       42
        South America       16